ankuns/nrfx/bsp/stable/mdk/nrf7140_dppr.svd
          <register>
            <name>CMDPKTSTATUS</name>
            <description>Contains information about the status of FIFOs related to DBI and Generic interface.</description>
            <addressOffset>0x074</addressOffset>
            <access>read-write</access>
            <resetValue>0x05051515</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GENCMDEMPTY</name>
                <description>This bit indicates the empty status of the generic command FIFO.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GENCMDFULL</name>
                <description>This bit indicates the full status of the generic command FIFO.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GENPLDWEMPTY</name>
                <description>This bit indicates the empty status of the generic write payload FIFO.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GENPLDWFULL</name>
                <description>This bit indicates the full status of the generic write payload FIFO.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GENPLDREMPTY</name>
                <description>This bit indicates the empty status of the generic read payload FIFO.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GENPLDRFULL</name>
                <description>This bit indicates the full status of the generic read payload FIFO.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GENRDCMDBUSY</name>
                <description>This bit is set when a read command is issued and cleared when the entire response is stored in the FIFO for GENERIC interface.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBICMDEMPY</name>
                <description>This bit indicates the empty status of the DBI command FIFO.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBICMDFULL</name>
                <description>This bit indicates the full status of the DBI command FIFO.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBIPLDWEMPTY</name>
                <description>This bit indicates the empty status of the DBI write payload FIFO.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBIPLDWFULL</name>
                <description>This bit indicates the full status of the DBI write payload FIFO.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBIPLDREMPTY</name>
                <description>This bit indicates the empty status of the DBI read payload</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBIPLDRFULL</name>
                <description>This bit indicates the full status of the DBI read payload FIFO.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBIRDCMDBUSY</name>
                <description>This bit is set when a read command is issued and cleared when the entire response is stored in the FIFO for DBI interface.</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GENBUFFCMDEMPTY</name>
                <description>This bit indicates the empty status of the generic command internal buffer.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GENBUFFCMDFULL</name>
                <description>This bit indicates the full status of the generic command internal buffer.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GENBUFFPLDEMPTY</name>
                <description>This bit indicates the empty status of the generic payload internal buffer.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GENBUFFPLDFULL</name>
                <description>This bit indicates the full status of the generic payload internal buffer.</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBIBUFFCMDEMPTY</name>
                <description>This bit indicates the empty status of the DBI command internal buffer.</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBIBUFFCMDFULL</name>
                <description>This bit indicates the full status of the DBI command internal buffer.</description>
                <lsb>25</lsb>
                <msb>25</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBIBUFFPLDEMPTY</name>
                <description>This bit indicates the empty status of the DBI payload internal buffer.</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBIBUFFPLDFULL</name>
                <description>This bit indicates the full status of the DBI payload internal buffer.</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TOCNTCFG</name>
            <description>Configures counters that trigger timeout errors. These are used to warn the system of a failure, through an interrupt, and restart the controller in case of unexpected situations that cause deadlock conditions.</description>
            <addressOffset>0x078</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LPRXTOCNT</name>
                <description>This field configures the timeout counter that triggers a low-power reception timeout contention detection (measured in TO_CLK_DIVISION cycles).</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>HSTXTOCNT</name>
                <description>This field configures the timeout counter that triggers a high-speed transmission timeout contention detection (measured in TO_CLK_DIVISION cycles).</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HSRDTOCNT</name>
            <description>Configures the Peripheral Response timeout after high-speed Read operations.</description>
            <addressOffset>0x07C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HSRDTOCNT</name>
                <description>This field sets a period for which DSI keeps the link still, after sending a high-speed Read operation. This period is measured in cycles of lanebyteclk, starts to count when the D-PHY enters stop state and causes no interrupts.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LPRDTOCNT</name>
            <description>Configures the Peripheral Response timeout after low-power Read operations.</description>
            <addressOffset>0x080</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LPRDTOCNT</name>
                <description>This field sets a period for which DSI keeps the link still, after sending a low-power Read operation. This period is measured in cycles of lanebyteclk, starts to count when the D-PHY enters stop state and causes no interrupts.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HSWRTOCNT</name>
            <description>Configures the Peripheral Response timeout after high-speed Write operations.</description>
            <addressOffset>0x084</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HSWRTOCNT</name>
                <description>This field sets a period for which DSI keeps the link still, after sending a high-speed Write operation. This period is measured in cycles of lanebyteclk, starts to count when the D-PHY enters stop state and causes no interrupts.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LPWRTOCNT</name>
            <description>Configures the Peripheral Response timeout after low-power Write operations.</description>
            <addressOffset>0x088</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LPWRTOCNT</name>
                <description>This field sets a period for which DSI keeps the link still, after sending a low-power Write operation. This period is measured in cycles of lanebyteclk, starts to count when the D-PHY enters stop state and causes no interrupts.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BTATOCNT</name>
            <description>Configures the Peripheral Response timeout after Bus Turnaround completion.</description>
            <addressOffset>0x08C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BTATOCNT</name>
                <description>This field sets a period for which DSI keeps the link still, after completing a Bus Turnaround. This period is measured in cycles of lanebyteclk, starts to count when the D-PHY enters stop state and causes no interrupts.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SDF3D</name>
            <description>Stores 3D control information for VSS packets in video mode.</description>
            <addressOffset>0x090</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MODE3D</name>
                <description>This field defines 3D Mode On/Off and Display Orientation:</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MODE0</name>
                    <description>3D Mode Off , 2D Mode On</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MODE1</name>
                    <description>3D Mode On, Portrait Orientation</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MODE2</name>
                    <description>3D Mode On, Landscape Orientation</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MODE3</name>
                    <description>Reserved, not used</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORMAT3D</name>
                <description>This field defines 3D Image Format:</description>
                <lsb>2</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LINE</name>
                    <description>Alternating lines of left and right data</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FRAME</name>
                    <description>Alternating frames of left and right data</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXEL</name>
                    <description>Alternating pixels of left and right data</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECONDVSYNC</name>
                <description>This field defines whether there is a second VSYNC pulse between Left and Right Images, when 3D Image Format is Frame-based:</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOSYNC</name>
                    <description>No sync pulses between left and right data</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SYNC</name>
                    <description>Sync pulse HSYNC, VSYNC, blanking between left and right data</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RIGHTFIRST</name>
                <description>This bit defines the left/right order:</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LFIRST</name>
                    <description>left eye is sent first, then right eye</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RFIRST</name>
                    <description>right eye data is sent first, then left eye</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND3DCFG</name>
                <description>When set, causes the next VSS packet to include 3D control payload in every VSS packet.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LPCLKCTRL</name>
            <description>Configures the possibility for using non continuous clock in the clock lane.</description>
            <addressOffset>0x094</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHYTXREQUESTCLKHS</name>
                <description>This bit controls the D-PHY PPI txrequestclkhs signal.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>AUTOCLKLANECTRL</name>
                <description>This bit enables the automatic mechanism to stop providing clock in the clock lane when time allows.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYTMRLPCLKCFG</name>
            <description>Sets the time that DSI assumes in calculations for the clock lane to switch between high-speed and low-power.</description>
            <addressOffset>0x098</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHYCLKLP2HSTIME</name>
                <description>This field configures the maximum time that the D-PHY clock lane takes to go from low-power to high-speed transmission measured in lane byte clock cycles.</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>PHYCLKHS2LPTIME</name>
                <description>This field configures the maximum time that the D-PHY clock lane takes to go from high-speed to low-power transmission measured in lane byte clock cycles.</description>
                <lsb>16</lsb>
                <msb>25</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYTMRCFG</name>
            <description>Sets the time that DSI assumes in calculations for the data lanes to switch between high-speed and low-power.</description>
            <addressOffset>0x09C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHYLP2HSTIME</name>
                <description>This field configures the maximum time that the D-PHY data lanes take to go from low-power to high-speed transmission measured in lane byte clock cycles.</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>PHYHS2LPTIME</name>
                <description>This field configures the maximum time that the D-PHY data lanes take to go from high-speed to low-power transmission measured in lane byte clock cycles.</description>
                <lsb>16</lsb>
                <msb>25</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYRSTZ</name>
            <description>Controls resets and the PLL of the D-PHY.</description>
            <addressOffset>0x0A0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHYSHUTDOWNZ</name>
                <description>When set to 0, this bit places the complete D-PHY macro in power-down state.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>PHYRSTZ</name>
                <description>When set to 0, this bit places the digital section of the D-PHY in the reset state.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>PHYENABLECLK</name>
                <description>When set to 1, this bit enables the D-PHY Clock Lane Module.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>PHYFORCEPLL</name>
                <description>When the D-PHY is in ULPS, this bit enables the D-PHY PLL.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYIFCFG</name>
            <description>Configures the number of active lanes and the minimum time to remain in stop state.</description>
            <addressOffset>0x0A4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NLANES</name>
                <description>This field configures the number of active data lanes:</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ONELANES</name>
                    <description>lane 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TWOLANES</name>
                    <description>lanes 0 and 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THREELANES</name>
                    <description>lanes 0, 1, and 2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FOURLANES</name>
                    <description>lanes 0, 1, 2, and 3</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PHYSTOPWAITTIME</name>
                <description>This field configures the minimum time PHY needs to stay in StopState before requesting an high-speed transmission</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
