ankuns/nrfx/bsp/stable/mdk/nrf7140_dppr.svd
          <register>
            <name>SDF3DACT</name>
            <description>Holds the value that controller is using for SDF_3D.</description>
            <addressOffset>0x190</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MODE3D</name>
                <description>This field specifies 3D Mode On/Off and Display Orientation:</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MODE0</name>
                    <description>3D Mode Off, 2D Mode On</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MODE1</name>
                    <description>3D Mode On, Portrait Orientation</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MODE2</name>
                    <description>3D Mode On, Landscape Orientation</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MODE3</name>
                    <description>Reserved, not used</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORMAT3D</name>
                <description>This field specifies 3D Image Format:</description>
                <lsb>2</lsb>
                <msb>3</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LINE</name>
                    <description>Alternating lines of left and right data</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FRAME</name>
                    <description>Alternating frames of left and right data</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXEL</name>
                    <description>Alternating pixels of left and right data</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECONDVSYNC</name>
                <description>This field specifies whether there is a second VSYNC pulse between Left and Right Images, when 3D Image Format is Frame-based:</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOSYNCPULSE</name>
                    <description>No sync pulses between left and right data.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SYNCPULSE</name>
                    <description>Sync pulse (HSYNC, VSYNC, blanking) between left and right data.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RIGHTFIRST</name>
                <description>This bit specifies the left/right order:</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LEFTFIRST</name>
                    <description>left eye is sent first, then right eye</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RIGHTFIRST</name>
                    <description>right eye data is sent first, then left eye</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND3DCFG</name>
                <description>When set, causes the next VSS packet to include 3D control payload in every VSS packet.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>CSI2</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_GSI_CSI2</headerStructName>
          <access>read-write</access>
          <addressOffset>0x2000</addressOffset>
          <register>
            <name>VERSION</name>
            <description>Contains the version of DWC_mipi_csi2_host coded in 32-bit ASCII code.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x30313534</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VERSION</name>
                <description>This field indicates the version of the DWC_mipi_csi2_host.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>NLANES</name>
            <description>Configures the number of active lanes that the DWC_mipi_csi2_host uses to receive the camera device data.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NLANES</name>
                <description>This can only be updated when the PHY lane is in stopstate.Number of active data lanes:</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DATALANE1</name>
                    <description>1 Data Lane</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DATALANE2</name>
                    <description>2 Data Lanes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DATALANE3</name>
                    <description>3 Data Lanes</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DATALANE4</name>
                    <description>4 Data Lanes - Only on D-PHY</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DATALANE5</name>
                    <description>5 Data Lanes - Only on D-PHY</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DATALANE6</name>
                    <description>6 Data Lanes - Only on D-PHY</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DATALANE7</name>
                    <description>7 Data Lanes - Only on D-PHY</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DATALANE8</name>
                    <description>8 Data Lanes - Only on D-PHY</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CSI2RESETN</name>
            <description>Controls the DWC_mipi_csi2_host logic reset state. When activated, the internal logic of the controller goes into the reset state. The configuration is not reset to default values with this register, instead, only the internal controller logic is affected.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CSI2RESETN</name>
                <description>DWC_mipi_csi2_host reset output. Active Low.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTSTMAIN</name>
            <description>Contains the status of individual interrupt sources, regardless of the contents of the associated interrupt mask registers, so it is possible to service the interrupt status registers by polling. Reading INT_ST_MAIN register clears the interrupt pin.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STATUSINTSTPHYFATAL</name>
                <description>Status of int_st_phy_fatal.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>STATUSINTSTPKTFATAL</name>
                <description>Status of int_st_pkt_fatal.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>STATUSINTSTBNDRYFRAMEFATAL</name>
                <description>Status of int_st_bndry_frame_fatal.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>STATUSINTSTSEQFRAMEFATAL</name>
                <description>Status of int_st_seq_frame_fatal.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>STATUSINTSTCRCFRAMEFATAL</name>
                <description>Status of int_st_crc_frame_fatal.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>STATUSINTSTPLDCRCFATAL</name>
                <description>Status of int_st_pld_crc_fatal.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>STATUSINTSTDATAID</name>
                <description>Status of int_st_data_id.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>STATUSINTSTECCCORRECTED</name>
                <description>Status of int_st_ecc_corrected.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>STATUSINTSTPHY</name>
                <description>Status of int_st_phy.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYSHUTDOWNZ</name>
            <description>Controls the PHY Shutdown mode. In this state, the PHY sets the analog and digital circuitry in the Reset state.</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHYSHUTDOWNZ</name>
                <description>Shutdown input. This line is used to place the complete macro in power down. All analog blocks are in power down mode and digital logic is cleared. Active Low.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DPHYRSTZ</name>
            <description>Controls the PHY Reset mode. In this state, the PHY sets the digital circuitry in the Reset State.</description>
            <addressOffset>0x044</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DPHYRSTZ</name>
                <description>PHY reset output. Active Low.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYRX</name>
            <description>Contains the status of RX-related signals from PHY:</description>
            <addressOffset>0x048</addressOffset>
            <access>read-write</access>
            <resetValue>0x00010000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHYRXULPSESC0</name>
                <description>Lane module 0 has entered the Ultra Low Power mode.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYRXULPSESC1</name>
                <description>Lane module 1 has entered the Ultra Low Power mode</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYRXULPSCLKNOT</name>
                <description>Active Low. This signal indicates that D-PHY Clock Lane module has entered the Ultra Low Power state</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYRXCLKACTIVEHS</name>
                <description>Indicates that D-PHY clock lane is actively receiving a DDR clock</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYSTOPSTATE</name>
            <description>Contains the STOPSTATE signal status from PHY.</description>
            <addressOffset>0x04C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHYSTOPSTATEDATA0</name>
                <description>Data lane 0 in Stop state.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYSTOPSTATEDATA1</name>
                <description>Data lane 1 in Stop state</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYSTOPSTATECLK</name>
                <description>D-PHY Clock lane in Stop state</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYTESTCTRL0</name>
            <description>Control for vendor specific interface in the PHY.</description>
            <addressOffset>0x050</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHYTESTCLR</name>
                <description>When active, performs vendor specific interface initialization.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>PHYTESTCLK</name>
                <description>Clock to capture testdin bus contents into the macro, with testen signal controlling the operation selection.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYTESTCTRL1</name>
            <description>Control for vendor specific interface in the PHY.</description>
            <addressOffset>0x054</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHYTESTDIN</name>
                <description>Test interface 8-bit data input for programming internal registers and accessing test functionalities.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>PHYTESTDOUT</name>
                <description>Vendor-specific 8-bit data output for reading data and other probing functionalities.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYTESTEN</name>
                <description>When asserted high, it configures an address write operation on the falling edge of testclk. When asserted low, it configures a data write operation on the rising edge of testclk.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PPIPGPATTERNVRES</name>
            <description>This register configures the PPI pattern Generator's pattern vertical resolution.</description>
            <addressOffset>0x060</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PPIPGPATTERNVRES</name>
                <description>This register configures the PPI pattern Generator's pattern vertical resolution.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PPIPGPATTERNHRES</name>
            <description>This register configures the PPI pattern Generator's pattern horizontal resolution.</description>
            <addressOffset>0x064</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PPIPGPATTERNHRES</name>
                <description>This register configures the PPI pattern Generator's pattern horizontal resolution.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>PPIPGPKT2PKTTIME</name>
                <description>This register configures the PPI pattern Generator's packet-to-packet time.</description>
                <lsb>16</lsb>
                <msb>25</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PPIPGCONFIG</name>
            <description>This register configures the PPI pattern Generator.</description>
            <addressOffset>0x068</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PPIPGPATTERN</name>
                <description>This register configures the PPI pattern Generator's pattern:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VERTICAL</name>
                    <description>Vertical Pattern</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HORIZONTAL</name>
                    <description>Horizontal Pattern</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PPIPGDATATYPE</name>
                <description>This register configures the PPI pattern Generator's data type.</description>
                <lsb>8</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>PPIPGVC</name>
                <description>This register configures the PPI pattern Generator's virtual channel.</description>
                <lsb>14</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>PPIPGVCX01</name>
                <description>This register configures the PPI pattern Generator's virtual channel extension.</description>
                <lsb>16</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PPIPGENABLE</name>
            <description>This register enables PPI pattern Generator.</description>
            <addressOffset>0x06C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PPIPGENABLE</name>
                <description>This register enables PPI pattern Generator.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PPIPGSTATUS</name>
            <description>This register indicates PPI Pattern Generator Status.</description>
            <addressOffset>0x070</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PPIPGSTATUS</name>
                <description>PPI Pattern Generator status:</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>PPI PG is inactive</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVE</name>
                    <description>PPI PG is running</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
