ankuns/nrfx/bsp/stable/mdk/nrf7140_dppr.svd
          <register>
            <name>VCEXTENSION</name>
            <description>This register activates extra bits for virtual channel. The Virtual Channel Extension (VCX) field is common to both options, but is a 2-bit field for D-PHY and a 3-bit field for C-PHY.</description>
            <addressOffset>0x0C8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VCX</name>
                <description>This field indicates status of Virtual Channel Extension:</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYCAL</name>
            <description>Contains the CALIBRATION signal status from Synopsys D-PHY.</description>
            <addressOffset>0x0CC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXSKEWCALHS</name>
                <description>A low-to-high transition on rxskewcalhs signal means that the PHY has initiated the de-skew calibration.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTSTPHYFATAL</name>
            <description>Groups the fatal interruptions caused by PHY Packet discarded.</description>
            <addressOffset>0x0E0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHYERRSOTSYNCHS0</name>
                <description>Start of transmission error on data lane 0 (no synchronization achieved).</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYERRSOTSYNCHS1</name>
                <description>Start of transmission error on data lane 1 (no synchronization achieved)</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTMSKPHYFATAL</name>
            <description>Interrupt mask for INT_ST_PHY_FATAL controls which interrupt status bits trigger the interrupt pin. Bit at 1 - Enable the interrupt source. Bit at 0 - Interrupt source is masked.</description>
            <addressOffset>0x0E4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MASKPHYERRSOTSYNCHS0</name>
                <description>Mask for phy_errsotsynchs_0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>MASKPHYERRSOTSYNCHS1</name>
                <description>Mask for phy_errsotsynchs_1</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTFORCEPHYFATAL</name>
            <description>Interrupt Force register is used for test purposes, and allows triggering INT_ST_PHY_FATAL interrupt events individually, without the need to activate the conditions that trigger the interrupt sources, since it may be extremely complex to generate stimuli for that purpose. This register is auto-clear.</description>
            <addressOffset>0x0E8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FORCEPHYERRSOTSYNCHS0</name>
                <description>Force phy_errsotsynchs_0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>FORCEPHYERRSOTSYNCHS1</name>
                <description>Force phy_errsotsynchs_1</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTSTPKTFATAL</name>
            <description>Groups the fatal interruption related with Packet construction. Packet discarded.</description>
            <addressOffset>0x0F0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRECCDOUBLE</name>
                <description>D-PHY mode: Header ECC contains at least 2 errors, unrecoverable.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SHORTERPAYLOAD</name>
                <description>D-PHY mode: Reported greater WC than received, unrecoverable.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTMSKPKTFATAL</name>
            <description>Interrupt mask for INT_ST_PKT_FATAL controls which interrupt status bits trigger the interrupt pin. Bit at 1 - Enable the interrupt source. Bit at 0 - Interrupt source is masked.</description>
            <addressOffset>0x0F4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MASKERRECCDOUBLE</name>
                <description>Mask for err_ecc_double.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>MASKSHORTERPAYLOAD</name>
                <description>Mask for shorter_payload.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTFORCEPKTFATAL</name>
            <description>Interrupt force register is used for test purposes, and allows triggering INT_ST_PKT_FATAL interrupt events individually, without the need to activate the conditions that trigger the interrupt sources, since it may be extremely complex to generate stimuli for that purpose. This register is auto-clear.</description>
            <addressOffset>0x0F8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FORCEERRECCDOUBLE</name>
                <description>Force err_ecc_double.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>FORCESHORTERPAYLOAD</name>
                <description>Force shorter_payload.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTSTPHY</name>
            <description>Interruption caused by PHY.</description>
            <addressOffset>0x110</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHYERRSOTHS0</name>
                <description>Start of transmission error on data lane 0 (synchronization can still be achieved).</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYERRSOTHS1</name>
                <description>Start of transmission error on data lane 1 (synchronization can still be achieved)</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYERRESC0</name>
                <description>Escape Entry Error on data lane 0.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYERRESC1</name>
                <description>Escape Entry Error on data lane 1</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTMSKPHY</name>
            <description>Interrupt mask for INT_ST_PHY controls which interrupt status bits trigger the interrupt pin. Bit at 1 - Enable the interrupt source. Bit at 0 - Interrupt source is masked.</description>
            <addressOffset>0x114</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MASKPHYERRSOTHS0</name>
                <description>Mask for phy_errsoths_0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>MASKPHYERRSOTHS1</name>
                <description>Mask for phy_errsoths_1</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>MASKPHYERRESC0</name>
                <description>Mask for phy_erresc_0.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>MASKPHYERRESC1</name>
                <description>Mask for phy_erresc_1</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTFORCEPHY</name>
            <description>Interrupt force register is used for test purposes, and allows triggering INT_ST_PHY interrupt events individually. There is no need to activate the conditions that trigger the interrupt sources, because it may be extremely complex to generate stimuli for that purpose. This register is auto-clear.</description>
            <addressOffset>0x118</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FORCEPHYERRSOTHS0</name>
                <description>Force phy_errsoths_0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>FORCEPHYERRSOTHS1</name>
                <description>Force phy_errsoths_1</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>FORCEPHYERRESC0</name>
                <description>Force phy_erresc_0</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>FORCEPHYERRESC1</name>
                <description>Force phy_erresc_1</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTSTBNDRYFRAMEFATAL</name>
            <description>Fatal interruption related with matching Frame Start with Frame End for a specific virtual channel.</description>
            <addressOffset>0x280</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRFBNDRYMATCHVC0</name>
                <description>Error matching Frame Start with Frame End for virtual channel 0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC1</name>
                <description>Error matching Frame Start with Frame End for virtual channel 1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC2</name>
                <description>Error matching Frame Start with Frame End for virtual channel 2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC3</name>
                <description>Error matching Frame Start with Frame End for virtual channel 3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC4</name>
                <description>Error matching Frame Start with Frame End for virtual channel 4.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC5</name>
                <description>Error matching Frame Start with Frame End for virtual channel 5.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC6</name>
                <description>Error matching Frame Start with Frame End for virtual channel 6.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC7</name>
                <description>Error matching Frame Start with Frame End for virtual channel 7.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC8</name>
                <description>Error matching Frame Start with Frame End for virtual channel 8.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC9</name>
                <description>Error matching Frame Start with Frame End for virtual channel 9.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC10</name>
                <description>Error matching Frame Start with Frame End for virtual channel 10.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC11</name>
                <description>Error matching Frame Start with Frame End for virtual channel 11.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC12</name>
                <description>Error matching Frame Start with Frame End for virtual channel 12.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC13</name>
                <description>Error matching Frame Start with Frame End for virtual channel 13.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC14</name>
                <description>Error matching Frame Start with Frame End for virtual channel 14.</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC15</name>
                <description>Error matching Frame Start with Frame End for virtual channel 15.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTMSKBNDRYFRAMEFATAL</name>
            <description>Interrupt mask for INT_ST_BNDRY_FRAME_FATAL controls which interrupt status bits trigger the interrupt pin. Bit at 1 - Enable the interrupt source. Bit at 0 - Interrupt source is masked.</description>
            <addressOffset>0x284</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRFBNDRYMATCHVC0</name>
                <description>Mask for err_f_bndry_match_vc0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC1</name>
                <description>Mask for err_f_bndry_match_vc1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC2</name>
                <description>Mask for err_f_bndry_match_vc2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC3</name>
                <description>Mask for err_f_bndry_match_vc3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC4</name>
                <description>Mask for err_f_bndry_match_vc4.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC5</name>
                <description>Mask for err_f_bndry_match_vc5.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC6</name>
                <description>Mask for err_f_bndry_match_vc6.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC7</name>
                <description>Mask for err_f_bndry_match_vc7.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC8</name>
                <description>Mask for err_f_bndry_match_vc8.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC9</name>
                <description>Mask for err_f_bndry_match_vc9.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC10</name>
                <description>Mask for err_f_bndry_match_vc10.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC11</name>
                <description>Mask for err_f_bndry_match_vc11.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC12</name>
                <description>Mask for err_f_bndry_match_vc12.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC13</name>
                <description>Mask for err_f_bndry_match_vc13.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC14</name>
                <description>Mask for err_f_bndry_match_vc14.</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>ERRFBNDRYMATCHVC15</name>
                <description>Mask for err_f_bndry_match_vc15.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
