ankuns/nrfx/bsp/stable/mdk/nrf7140_dppr.svd
          <register>
            <name>DRAWPT0X</name>
            <description>X coordinate of bezier vertex 0 drawing primitive.</description>
            <addressOffset>0x320</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>X</name>
                <description>Specifies the X coordinate of bezier vertex 0 drawing primitive (fp32 format)</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DRAWPT0Y</name>
            <description>Y coordinate of bezier vertex 0 drawing primitive.</description>
            <addressOffset>0x324</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Y</name>
                <description>Specifies the Y coordinate of bezier vertex 0 drawing primitive (fp32 format)</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DRAWFPFANX</name>
            <description>X coordinate of the Fan center point. Its content should be considered volatile.</description>
            <addressOffset>0x328</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>X</name>
                <description>Specifies the X coordinate of bezier vertex 4 drawing primitive (fp32 format)</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DRAWFPFANY</name>
            <description>Y coordinate of the Fan center point. Its content should be considered volatile.</description>
            <addressOffset>0x32C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Y</name>
                <description>Specifies the X coordinate of bezier vertex 4 drawing primitive (fp32 format)</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DRAWPT1X</name>
            <description>X coordinate of bezier vertex 1 drawing primitive.</description>
            <addressOffset>0x330</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>X</name>
                <description>Specifies the X coordinate of bezier vertex 1 drawing primitive (fp32 format)</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DRAWPT1Y</name>
            <description>Y coordinate of bezier vertex 1 drawing primitive.</description>
            <addressOffset>0x334</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Y</name>
                <description>Specifies the Y coordinate of bezier vertex 1 drawing primitive (fp32 format)</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DRAWPT2X</name>
            <description>X coordinate of bezier vertex 2 drawing primitive.</description>
            <addressOffset>0x340</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>X</name>
                <description>Specifies the X coordinate of bezier vertex 2 drawing primitive (fp32 format)</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DRAWPT2Y</name>
            <description>Y coordinate of bezier vertex 2 drawing primitive.</description>
            <addressOffset>0x344</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Y</name>
                <description>Specifies the Y coordinate of bezier vertex 2 drawing primitive (fp32 format)</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DRAWPT3X</name>
            <description>X coordinate of bezier vertex 3 drawing primitive.</description>
            <addressOffset>0x350</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>X</name>
                <description>Specifies the X coordinate of bezier vertex 3 drawing primitive (fp32 format)</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DRAWPT3Y</name>
            <description>Y coordinate of bezier vertex 3 drawing primitive.</description>
            <addressOffset>0x354</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Y</name>
                <description>Specifies the Y coordinate of bezier vertex 3 drawing primitive (fp32 format)</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>VMM00</name>
            <description>(0,0) Bezier Vertex Transformation matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x360</addressOffset>
            <access>read-write</access>
            <resetValue>0x3F800000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VMM00</name>
                <description>Specifies the (0,0) element</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>VMM00POS31LEN1</name>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VMM01</name>
            <description>(0,1) Bezier Vertex Transformation matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x364</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VMM01</name>
                <description>Specifies the (0,1) element</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>VMM01POS31LEN1</name>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VMM02</name>
            <description>(0,2) Bezier Vertex Transformation matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x368</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VMM02</name>
                <description>Specifies the (0,2) element</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>VMM02POS31LEN1</name>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VMM10</name>
            <description>(1,0) Bezier Vertex Transformation matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x36C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VMM10</name>
                <description>Specifies the (1,0) element</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>VMM10POS31LEN1</name>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VMM11</name>
            <description>(1,1) Bezier Vertex Transformation matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x370</addressOffset>
            <access>read-write</access>
            <resetValue>0x3F800000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VMM11</name>
                <description>Specifies the (1,1) element</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>VMM11POS31LEN1</name>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VMM12</name>
            <description>(1,2) Bezier Vertex Transformation matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x374</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VMM12</name>
                <description>Specifies the (1,2) element</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>VMM12POS31LEN1</name>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VMM20</name>
            <description>(2,0) Bezier Vertex Transformation matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x378</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VMM20</name>
                <description>Specifies the (2,0) element</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>VMM20POS31LEN1</name>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VMM21</name>
            <description>(2,1) Bezier Vertex Transformation matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x37C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VMM21</name>
                <description>Specifies the (2,1) element</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>VMM21POS31LEN1</name>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VMM22</name>
            <description>(2,2) Bezier Vertex Transformation matrix floating point element. On read return the floating point value with the selected characteristics</description>
            <addressOffset>0x380</addressOffset>
            <access>read-write</access>
            <resetValue>0x3F800000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VMM22</name>
                <description>Specifies the (2,2) element</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>VMM22POS31LEN1</name>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCOORDMASK</name>
            <description>Inverted mask for rasterizer coordinates</description>
            <addressOffset>0x4D0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000FFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPUCOORDMASK</name>
                <description>Inverted mask for rasterizer coordinates</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DRAWFLATNESS</name>
            <description>Width in pixels of Bezier Curve flatness. (Lower values improve accuracy)</description>
            <addressOffset>0x4D4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00008000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FLATNESS</name>
                <description>Specifies the convergence point of de Casteljau's Algorithm for drawing Bezier Curves (fixed point 16.16 format)</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUGAMMAADDR</name>
            <description>Enables Gamma LUTs and Set the internal address</description>
            <addressOffset>0x508</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPUGAMMAADDR</name>
                <description>Specifies the internal address of LUTs</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GPUGAMMAADDRPOS16LEN15</name>
                <lsb>16</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>GAMMAENABLE</name>
                <description>Enables the Gamma Luts</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUGAMMADATA</name>
            <description>Specify the Gamma LUT data</description>
            <addressOffset>0x510</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GPUGAMMADATA</name>
                <description>Specify the Gamma LUT data for the specified address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX0BASEL</name>
            <description>Texture mapping registers of drawing surface 0.(low bits)</description>
            <addressOffset>0x800</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BASEL</name>
                <description>Image 0 Base Address low bits</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX0BASEH</name>
            <description>Texture mapping registers of drawing surface 0.(high bits)</description>
            <addressOffset>0x804</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BASEH</name>
                <description>Image 0 Base Address high bits</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX1BASEL</name>
            <description>Texture mapping registers of drawing surface 1.(low bits)</description>
            <addressOffset>0x810</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BASEL</name>
                <description>Image 1 Base Address low bits</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX1BASEH</name>
            <description>Texture mapping registers of drawing surface 1.(high bits)</description>
            <addressOffset>0x814</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BASEH</name>
                <description>Image 1 Base Address high bits</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX2BASEL</name>
            <description>Texture mapping registers of drawing surface 2.(low bits)</description>
            <addressOffset>0x820</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BASEL</name>
                <description>Image 2 Base Address low bits</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX2BASEH</name>
            <description>Texture mapping registers of drawing surface 2.(high bits)</description>
            <addressOffset>0x824</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BASEH</name>
                <description>Image 2 Base Address high bits</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX3BASEL</name>
            <description>Texture mapping registers of drawing surface 3.(low bits)</description>
            <addressOffset>0x830</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BASEL</name>
                <description>Image 3 Base Address low bits</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUTEX3BASEH</name>
            <description>Texture mapping registers of drawing surface 3.(high bits)</description>
            <addressOffset>0x834</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BASEH</name>
                <description>Image 3 Base Address high bits</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCMDRINGSTOPL</name>
            <description>Ring Buffer's pointer Low bits.</description>
            <addressOffset>0x840</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CMDRINGSTOPL</name>
                <description>Updates Ring Buffer's last written address Low bits.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCMDRINGSTOPH</name>
            <description>Ring Buffer's pointer High bits.</description>
            <addressOffset>0x844</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CMDRINGSTOPH</name>
                <description>Updates Ring Buffer's last written address High bits.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUCMDADDRL</name>
            <description>Command List base address Low bits</description>
            <addressOffset>0x848</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CMDADDRL</name>
                <description>Command List address Low bits</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
