ankuns/nrfx/bsp/stable/mdk/nrf7140_dppr.svd
          <register>
            <name>APABILITIES1R</name>
            <description>Unspecified</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <resetValue>0x3F6A0181</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TOUTCLKFREQ</name>
                <lsb>0</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RSVD6</name>
                <description>This bit of the CAPABILITIES1_R register is reserved. It always returns 0.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>TOUTCLKUNIT</name>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>KHZ</name>
                    <description>KHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MHZ</name>
                    <description>MHz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BASECLKFREQ</name>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>MAXBLKLEN</name>
                <lsb>16</lsb>
                <msb>17</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ZERO</name>
                    <description>512 Byte</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ONE</name>
                    <description>1024 Byte</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TWO</name>
                    <description>2048 Byte</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>THREE</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EMBEDDED8BIT</name>
                <lsb>18</lsb>
                <msb>18</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>8-bit Bus Width not Supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>8-bit Bus Width Supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ADMA2SUPPORT</name>
                <lsb>19</lsb>
                <msb>19</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>ADMA2 not Supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>ADMA2 Supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD20</name>
                <description>This bit of the CAPABILITIES1_R is a reserved. It always returns 0.</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>HIGHSPEEDSUPPORT</name>
                <lsb>21</lsb>
                <msb>21</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>High Speed not Supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>High Speed Supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SDMASUPPORT</name>
                <lsb>22</lsb>
                <msb>22</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>SDMA not Supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>SDMA Supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SUSRESSUPPORT</name>
                <lsb>23</lsb>
                <msb>23</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Not Supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VOLT33</name>
                <lsb>24</lsb>
                <msb>24</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>3.3V Not Supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>3.3V Supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VOLT30</name>
                <lsb>25</lsb>
                <msb>25</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>SD 3.0V or Embedded 1.2V Not Supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>SD 3.0V or Embedded Supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VOLT18</name>
                <lsb>26</lsb>
                <msb>26</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>1.8V Not Supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>1.8V Supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SYSADDR64V4</name>
                <lsb>27</lsb>
                <msb>27</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>64-bit System Address for V4 is Not Supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>64-bit System Address for V4 is Supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SYSADDR64V3</name>
                <lsb>28</lsb>
                <msb>28</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>64-bit System Address for V3 is Not Supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>64-bit System Address for V3 is Supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ASYNCINTSUPPORT</name>
                <lsb>29</lsb>
                <msb>29</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Asynchronous Interrupt Not Supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Asynchronous Interrupt Supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLOTTYPER</name>
                <lsb>30</lsb>
                <msb>31</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>REMOVABLESLOT</name>
                    <description>Removable Card Slot</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EMBEDDEDSLOT</name>
                    <description>Embedded Slot for one Device</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SHAREDSLOT</name>
                    <description>Shared Bus Slot (SD mode)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UHS2EMBEDDEDSLOT</name>
                    <description>UHS-II Multiple Embedded Devices</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>APABILITIES2R</name>
            <description>Unspecified</description>
            <addressOffset>0x044</addressOffset>
            <access>read-write</access>
            <resetValue>0x00008077</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SDR50SUPPORT</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>SDR50 is not supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>SDR50 is supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SDR104SUPPORT</name>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>SDR104 is not supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>SDR104 is supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DDR50SUPPORT</name>
                <description>DDR50 Support (UHS-I only)</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>DDR50 is not supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>DDR50 is supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UHS2SUPPORT</name>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>UHS-II is not supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>UHS-II is supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DRVTYPEA</name>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Driver Type A is not supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Driver Type A is supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DRVTYPEC</name>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Driver Type C is not supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Driver Type C is supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DRVTYPED</name>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>Driver Type D is not supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>Driver Type D is supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD39</name>
                <description>This bit (RSVD_39) of the CAPABILITIES2_R register is reserved. It always returns 0.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RETUNECNT</name>
                <lsb>8</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RSVD44</name>
                <description>This bit (RSVD_44) of the CAPABILITIES2_R register is reserved. It always returns 0.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>USETUNINGSDR50</name>
                <description>Use Tuning for SDR50 (UHS-I only)</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ZERO</name>
                    <description>SDR50 does not require tuning</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ONE</name>
                    <description>SDR50 requires tuning</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RETUNINGMODES</name>
                <lsb>14</lsb>
                <msb>15</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MODE1</name>
                    <description>Timer</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MODE2</name>
                    <description>Timer and Re-Tuning Request (Not supported)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MODE3</name>
                    <description>Auto Re-Tuning (for transfer)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RSVDMODE</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLKMUL</name>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RSVD5658</name>
                <description>These bits (RSVD_56_58) of the CAPABILITIES2_R register are reserved. They always return 0.</description>
                <lsb>24</lsb>
                <msb>26</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ADMA3SUPPORT</name>
                <lsb>27</lsb>
                <msb>27</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>ADMA3 not Supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>ADMA3 Supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDD218VSUPPORT</name>
                <description>1.8V VDD2 Support</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FALSE</name>
                    <description>1.8V VDD2 is not Supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRUE</name>
                    <description>1.8V VDD2 is Supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD61</name>
                <description>This bit (RSVD_61) of the CAPABILITIES2_R register is reserved. It always returns 0.</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RSVD6263</name>
                <description>These bits (RSVD_62_63) of the CAPABILITIES2_R register are reserved bits. They always return 0.</description>
                <lsb>30</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
