ankuns/nrfx/bsp/stable/mdk/nrf7140_dppr.svd
          <register>
            <name>RSTNPADCNFG</name>
            <description>SD/eMMC PHY's RSTN PAD settings are controlled here.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x0440</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>RXSEL</name>
                <description>Reciver type select for PAD. Controls the RXSEL value of SD/eMMC PHY RST_N PAD(s)</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>WEAKPULLEN</name>
                <description>Pull-up/Pul-down enable control for RST_N PAD(s)</description>
                <lsb>3</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Pull-up and pull-down functionality disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PULLUP</name>
                    <description>Weak pull up enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PULLDOWN</name>
                    <description>Weak pull down enabled</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ILLEGAL</name>
                    <description>Should not be used</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXSLEWCTRLP</name>
                <description>Slew control for P-Type RST_N Pad's TX</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>TXSLEWCTRLN</name>
                <description>Slew control for N-Type RST_N Pad's TX</description>
                <lsb>9</lsb>
                <msb>12</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PADTESTCNFG</name>
            <description>PAD TEST Path and direction control</description>
            <addressOffset>0x00E</addressOffset>
            <access>read-write</access>
            <resetValue>0x0004</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>TESTMODEEN</name>
                <description>enables test mode interface for all PADS. Functional interface is disabled.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PADFUNCMODE</name>
                    <description>PAD's functional mode I/F is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PADTESTMODE</name>
                    <description>PAD's test mode interface is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TESTDLYLINEEN</name>
                <description>Test enable for delay line testing</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TESTDLYLINEDIS</name>
                    <description>Testing of Delay line disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TESTDLYLINEEN</name>
                    <description>Testing of delay line enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TESTCLKEN</name>
                <description>. While updating delay codes during testmode, this signal is used to gate the test clock. Functional interface is disabled.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TESTCLKGATED</name>
                    <description>Gate the test clock</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TESTCLKENABLED</name>
                    <description>Test clock is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RSVD1</name>
                <description>RSVD1 field is reserved</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>TESTOE</name>
                <description>test interface OE control. Drive's PHY's itest_oe inputs.</description>
                <lsb>4</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PADTESTOUT</name>
            <description>PAD TEST Path Data out, Drives itest_a input of SD/eMMC PHY</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>TESTDATAOUT</name>
                <description>Data written here is reflected on corresponding itest_a. Indivitual bits are mapped to corresponding itest_a inputs of the PHY</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PADTESTIN</name>
            <description>PAD TEST Path Data in, reflects value of otest_y output of SD/eMMC PHY</description>
            <addressOffset>0x012</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>TESTDATAIN</name>
                <description>individual bits here capture data avaliable on corresponding otest_y output. should be used for DC test and low freq data patterns.</description>
                <lsb>0</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PRBSCNFG</name>
            <description>Register to configure PRBS engine</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFF</resetValue>
            <dataType>uint16_t</dataType>
            <size>0x10</size>
            <fields>
              <field>
                <name>INITSEED</name>
                <description>Value programmed here is used as SEED for PRBS engine</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYLPBKCNFG</name>
            <description>Register to setup loopback mode</description>
            <addressOffset>0x01A</addressOffset>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <dataType>uint8_t</dataType>
            <size>0x8</size>
            <fields>
              <field>
                <name>PHYLPBKEN</name>
                <description>PHY Local loop back mode is enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PHYLPBKMODEDIS</name>
                    <description>Controller is not in PHY loopback mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PHYLPBKMODEEN</name>
                    <description>Controller is now in PHY Loopback mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OUTENPHYLPBKMODE</name>
                <description>CMD/DATA output enable in PHY loopback mode</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OUTPUTDIS</name>
                    <description>CMD/DATA output is disable PHY Loopback mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OUTPUTEN</name>
                    <description>CMD/DATA output is enable PHY Loopback mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MMDLCNFG</name>
            <description>Config register to settings common to all DelayLines used in PHY</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <dataType>uint8_t</dataType>
            <size>0x8</size>
            <fields>
              <field>
                <name>DLSTEPSEL</name>
                <description>DelayLine's per step delay selection, Drives PHY's idl_step input</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>DLOUTEN</name>
                <description>When '1' DL outputs can be sampled on PADs. Drives idlout_en for all PADs</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DLOUTDIS</name>
                    <description>DelayLine outputs on PAD disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DLOUTEN</name>
                    <description>DelayLine outputs on PAD enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SDCLKDLCNFG</name>
            <description>Settings for SD/eMMC CLK DelayLine.</description>
            <addressOffset>0x01D</addressOffset>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <dataType>uint8_t</dataType>
            <size>0x8</size>
            <fields>
              <field>
                <name>EXTDLYEN</name>
                <description>Drives SD/eMMC CLK DelayLine's extdlyen input</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DEFMODE</name>
                    <description>Delay line defaut range setting</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EXTDLMODE</name>
                    <description>DelayLine works with extended delay range setting</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BYPASSEN</name>
                <description>Drives SD/eMMC CLK DelayLine's bypassen input</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DLMODE</name>
                    <description>Delay line active mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BYPASSMODE</name>
                    <description>DelayLine is bypass mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INPSELCNFG</name>
                <description>Drives SD/eMMC CLK DelayLine's config input. Value here selects the input source to DelayLine</description>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>UPDATEDC</name>
                <description>Prepares DealyLine for code update when '1'. Its recommended that this bit is 1 when SDCLKDL_DC is being written. Ensure this is '0' when not updating code.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DLMODE</name>
                    <description>DelayLine output is enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BYPASSMODE</name>
                    <description>output of DelayLine is DelayLine output active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SDCLKDLD</name>
            <description>SD/eMMC CLK DelayLine Delay Code value</description>
            <addressOffset>0x01E</addressOffset>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <dataType>uint8_t</dataType>
            <size>0x8</size>
            <fields>
              <field>
                <name>CCKDLDC</name>
                <description>Drives SD/eMMC CLK DelayLine's Delay Code input.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SMPLDLCNFG</name>
            <description>SD/eMMC cclk_rx DelayLine configuration settings</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x0C</resetValue>
            <dataType>uint8_t</dataType>
            <size>0x8</size>
            <fields>
              <field>
                <name>EXTDLYEN</name>
                <description>Drives CCLK_RX DelayLine's extdlyen input</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DEFMODE</name>
                    <description>Delay line defaut range setting</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EXTDLMODE</name>
                    <description>DelayLine works with extended delay range setting</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BYPASSEN</name>
                <description>Drives CCLK_RX DelayLine's bypassen input</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DLMODE</name>
                    <description>Delay line active mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BYPASSMODE</name>
                    <description>DelayLine is bypass mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INPSELCNFG</name>
                <description>Drives CCLK_RX DelayLine's config input. Value here selects the input source to DelayLine</description>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>INPSELOVERRIDE</name>
                <description>PHY's Sampling delay line config is controlled by controller using sample_cclk_sel,</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ATDLCNFG</name>
            <description>SD/eMMC drift_cclk_rx DelayLine configuration settings</description>
            <addressOffset>0x021</addressOffset>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <dataType>uint8_t</dataType>
            <size>0x8</size>
            <fields>
              <field>
                <name>EXTDLYEN</name>
                <description>Drives drift_cclk_rx DelayLine's extdlyen input</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DEFMODE</name>
                    <description>Delay line defaut range setting</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EXTDLMODE</name>
                    <description>DelayLine works with extended delay range setting</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BYPASSEN</name>
                <description>Drives drift_cclk_rx DelayLine's bypassen input</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DLMODE</name>
                    <description>Delay line active mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BYPASSMODE</name>
                    <description>DelayLine is bypass mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INPSELCNFG</name>
                <description>Drives drift_cclk_rx DelayLine's config input. Value here selects the input source to DelayLine</description>
                <lsb>2</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TSTPHY1DL0</name>
            <description>Settings for PHY1 Delay line 0 during testmode</description>
            <addressOffset>0x034</addressOffset>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <dataType>uint8_t</dataType>
            <size>0x8</size>
            <fields>
              <field>
                <name>PHY1DL0DC</name>
                <description>Delay code for PHY1 Delay Line0</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>PHY1DL0UPDATEDC</name>
                <description>Delay code Update for PHY1 Delay Line0</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TSTDLMODE</name>
                    <description>DelayLine output is enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TSTUPDATEMODE</name>
                    <description>During delay code update</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>VENDOR1</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_SDCARD_VENDOR1</headerStructName>
          <access>read-write</access>
          <addressOffset>0xB00</addressOffset>
          <register>
            <name>MSHCVERIDR</name>
            <description>This register reflects the current release number of DWC_mshc/DWC_mshc_lite.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x30323030</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MSHCVERID</name>
                <description>Current release number</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MSHCVERTYPER</name>
            <description>This register reflects the current release type of DWC_mshc/DWC_mshc_lite.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x67612A2A</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MSHCVERTYPE</name>
                <description>Current release type</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
