ankuns/nrfx/bsp/stable/mdk/nrf7140_dppr.svd
        <register>
          <name>ENABLE</name>
          <description>Enables the QSPI This requests clock for the IP core</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable the QSPI</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>CONFIG</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_QSPI_CONFIG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x404</addressOffset>
          <register>
            <name>TXBURSTLENGTH</name>
            <description>Transmit burst length</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000008</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of buffer lines</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXBURSTLENGTH</name>
            <description>Receive burst length</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000008</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of buffer lines</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXTRANSFERLENGTH</name>
            <description>Receive transfer full length</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000010</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of buffer lines</description>
                <lsb>0</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STOPON</name>
            <description>Stop the DMA if the CORE goes into any of the enabled states.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000003</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXUNEXPECTEDIDLE</name>
                <description>The CORE will go into idle if the CORE buffer is emptied,
          if the DMA still has data to transfer the CORE is not expected to go into idle state. This constitutes a buffer underflow.
          The CORE migth also go into idle if an error occurs.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Stop on tx unexpected idle disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Stop on tx unexpected idle enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXOVERFLOW</name>
                <description>This condition occurrs if the DMA attempts to write to the RX buffer in the CORE, but the buffer is full. When this bit is enabled the DMA will stop when the CORE buffer experiences a rx buffer overflow</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Stop on rx overflow disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Stop on rx overflow enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INTERNALBUSERROR</name>
                <description>Terminate the transaction if a INTERNALBUSERROR event is detected.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMABUSERROR</name>
                <description>Terminate the transaction if a DMA.ERROR event is detected.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMODE</name>
            <description>Determines if AXI-lite or full AXI is used.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AXIMODE</name>
                <description>Type of AXI access.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Lite</name>
                    <description>AXI Lite</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Full</name>
                    <description>Full AXI</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>FORMAT</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_QSPI_FORMAT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x418</addressOffset>
          <register>
            <name>DFS</name>
            <description>Data frame size</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DFS</name>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BPP</name>
            <description>Bits per pixel</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BPP</name>
                <lsb>0</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Reordering of pixels disabled</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4</name>
                    <description>4 Bits per pixel</description>
                    <value>0x04</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8</name>
                    <description>8 Bits per pixel</description>
                    <value>0x08</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16</name>
                    <description>16 Bits per pixel</description>
                    <value>0x10</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PIXELS</name>
            <description>Number of pixels following the command</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PIXELS</name>
                <description>Number of pixels</description>
                <lsb>0</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CILEN</name>
            <description>Command/Instruction length</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CILEN</name>
                <description>Number of words</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>DMA</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_QSPI_DMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <cluster>
            <name>STATUS</name>
            <description>EasyVDMA status registers.</description>
            <headerStructName>GLOBAL_QSPI_DMA_STATUS</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>BYTECOUNT</name>
              <description>Number of bytes sent or received during processing of current descriptor list</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>BYTECOUNT</name>
                  <description>Number of bytes sent or received during processing of current descriptor list</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>ATTRIBUTE</name>
              <description>Latest job attribute being processed.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ATTRIBUTE</name>
                  <description>Latest job attribute being processed.</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>ADDRESS</name>
              <description>Latest address being accessed.</description>
              <addressOffset>0x008</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ADDRESS</name>
                  <description>Latest address being accessed.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>JOBCOUNT</name>
              <description>Number of completed jobs in current descriptor list.</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>JOBCOUNT</name>
                  <description>Number of completed jobs in current descriptor list.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>BUSERROR</name>
              <description>AXI bus error status.</description>
              <addressOffset>0x010</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>BUSERROR</name>
                  <description>AXI bus error type</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NoError</name>
                      <description>There are no errors.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ReadError</name>
                      <description>Error related to memory when reading joblist, or error related to memory/register when reading data.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ReadDecodeError</name>
                      <description>Error related to the joblist address when reading joblist, or error related to address when reading memory/register.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>WriteError</name>
                      <description>Error related to memory/register when writing data.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>WriteDecodeError</name>
                      <description>Error related to the memory/register address when writing data.</description>
                      <value>0x4</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>FIFO</name>
              <description>Data fifo status.</description>
              <addressOffset>0x014</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RXFIFO</name>
                  <description>Memory-to-Peripheral direction data fifo status</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Empty</name>
                      <description>Fifo is empty.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NotEmpty</name>
                      <description>Fifo contains data.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Full</name>
                      <description>Fifo is full.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TXFIFO</name>
                  <description>Peripheral-to-Memory direction data fifo status</description>
                  <lsb>2</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Empty</name>
                      <description>Fifo is empty.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NotEmpty</name>
                      <description>Fifo contains data.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Full</name>
                      <description>Fifo is full.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>ACTIVE</name>
              <description>DMA activity state.</description>
              <addressOffset>0x018</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ACTIVE</name>
                  <description>DMA activity state.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Idle</name>
                      <description>DMA is in idle state.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Active</name>
                      <description>Data is being transferred.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>CONFIG</name>
            <description>General config registers</description>
            <headerStructName>GLOBAL_QSPI_DMA_CONFIG</headerStructName>
            <access>read-write</access>
            <addressOffset>0x100</addressOffset>
            <register>
              <name>BUFFERFILL</name>
              <description>Data to be used when data is sent with BufferFill attribute</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>BUFFERFILL</name>
                  <description>Data to be used when data is sent with BufferFill attribute</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>LISTPTR</name>
              <description>Start address of descriptor list</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>LISTPTR</name>
                  <description>Start address of descriptor list</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>LISTPARTTHRESH</name>
              <description>Threshold value for generating event EVENTS_DONE.PARTLIST when descriptor list is partially completed. Value is number of jobs.</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>LISTPARTTHRESH</name>
                  <description>Threshold value.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
