ankuns/nrfx/bsp/stable/mdk/nrf7140_dppr.svd
            <register>
              <name>RISR</name>
              <description>Raw Interrupt Status Register</description>
              <addressOffset>0x034</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TXEIR</name>
                  <description>Transmit FIFO Empty Raw Interrupt Status</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_txe_intr interrupt is not active prior masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_txe_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TXOIR</name>
                  <description>Transmit FIFO Overflow Raw Interrupt Status</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_txo_intr interrupt is not active prior masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_txo_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXUIR</name>
                  <description>Receive FIFO Underflow Raw Interrupt Status</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_rxu_intr interrupt is not active prior masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_rxu_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXOIR</name>
                  <description>Receive FIFO Overflow Raw Interrupt Status</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_rxo_intr interrupt is not active prior masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_rxo_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXFIR</name>
                  <description>Receive FIFO Full Raw Interrupt Status</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_rxf_intr interrupt is not active prior masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_rxf_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MSTIR</name>
                  <description>Multi-Controller Contention Raw Interrupt Status. This bit field is not present if the QSPI CORE is configured as a serial-target device.</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_mst_intr interrupt is not active prior masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_mst_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>XRXOIR</name>
                  <description>XIP Receive FIFO Overflow Raw Interrupt Status</description>
                  <lsb>6</lsb>
                  <msb>6</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_xrxo_intr interrupt is not active prior masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_xrxo_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TXUIR</name>
                  <description>Transmit FIFO Underflow Interrupt Raw Status</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_txu_intr interrupt is not active prior masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_txu_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>AXIER</name>
                  <description>AXI Error Interrupt Raw Status</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_axie_intr interrupt is not active prior masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_axie_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVD9RISR</name>
                  <lsb>9</lsb>
                  <msb>9</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SPITER</name>
                  <description>SPI Transmit Error Interrupt status.</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_spite_intr interrupt is not active prior to masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_spite_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DONER</name>
                  <description>SSI Done Interrupt Raw Status</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_done_intr interrupt is not active prior masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_done_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVD1231RISR</name>
                  <lsb>12</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>TXEICR</name>
              <description>Transmit FIFO Error Interrupt Clear Register Register</description>
              <addressOffset>0x038</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TXEICR</name>
                  <description>Clear Transmit FIFO Overflow/Underflow Interrupt.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDTXEICR</name>
                  <lsb>1</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RXOICR</name>
              <description>Receive FIFO Overflow Interrupt Clear Register</description>
              <addressOffset>0x03C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RXOICR</name>
                  <description>Clear Receive FIFO Overflow Interrupt.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDRXOICR</name>
                  <lsb>1</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RXUICR</name>
              <description>Receive FIFO Underflow Interrupt Clear Register</description>
              <addressOffset>0x040</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RXUICR</name>
                  <description>Clear Receive FIFO Underflow Interrupt.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDRXUICR</name>
                  <lsb>1</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MSTICR</name>
              <description>Multi-Controller Interrupt Clear Register</description>
              <addressOffset>0x044</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>MSTICR</name>
                  <description>Clear Multi-Controller Contention Interrupt.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDMSTICR</name>
                  <lsb>1</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>ICR</name>
              <description>Interrupt Clear Register</description>
              <addressOffset>0x048</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ICR</name>
                  <description>Clear Interrupts.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDICR</name>
                  <lsb>1</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>DMACR</name>
              <description>DMA Control Register</description>
              <addressOffset>0x04C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RDMAE</name>
                  <description>Receive DMA Enable. This bit enables/disables the receive FIFO DMA channel.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLE</name>
                      <description>Receive DMA disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Receive DMA enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TDMAE</name>
                  <description>Transmit DMA Enable. This bit enables/disables the transmit FIFO DMA channel.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLE</name>
                      <description>Transmit DMA disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Transmit DMA enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>IDMAE</name>
                  <description>Internal DMA Enable. This bit should be enabled only when CTRLR0.FRF = 0 (Motorola SPI) and CTRLR0.SPI_FRF &amp;gt; 0.</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>ATW</name>
                  <description>AXI transfer width for DMA transfers mapped to arsize/awsize. This value must be less than or equal to SSIC_AXI_DW. Values:</description>
                  <lsb>3</lsb>
                  <msb>4</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDDMACR5</name>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>AINC</name>
                  <description>Address Increment. Indicates whether to increment the AXI address on every transfer.</description>
                  <lsb>6</lsb>
                  <msb>6</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDDMACR7</name>
                  <lsb>7</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>ACACHE</name>
                  <description>AXI arcache/awcache signal value.</description>
                  <lsb>8</lsb>
                  <msb>11</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>APROT</name>
                  <description>AXI arprot/awprot signal value.</description>
                  <lsb>12</lsb>
                  <msb>14</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>AID</name>
                  <description>AXI awid/arid signal value.</description>
                  <lsb>15</lsb>
                  <msb>20</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDDMACR</name>
                  <lsb>21</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>DMATDLR</name>
              <description>DMA Transmit Data Level</description>
              <addressOffset>0x050</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DMATDL</name>
                  <description>Transmit Data Level. This bit field controls the level at which a DMA request is made by the transmit logic. It is equal to the watermark level; that is, the dma_tx_req signal is generated when the number of valid data entries in the transmit FIFO is equal to or below this field value, and TDMAE = 1.</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>RSVDDMATDLR</name>
                  <lsb>4</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>DMARDLR</name>
              <description>DMA Receive Data Level</description>
              <addressOffset>0x054</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DMARDL</name>
                  <description>Receive Data Level. This bit field controls the level at which a DMA request is made by the receive logic. The watermark level = DMARDL+1; that is, dma_rx_req is generated when the number of valid data entries in the receive FIFO is equal to or above this field value + 1, and RDMAE=1.</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>RSVDDMARDLR</name>
                  <lsb>4</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>IDR</name>
              <description>Identification Register</description>
              <addressOffset>0x058</addressOffset>
              <access>read-write</access>
              <resetValue>0x51535049</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>IDCODE</name>
                  <description>Identification code. The register contains the identification code of the peripheral, which is written into the register at configuration time using CoreConsultant.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SSICVERSIONID</name>
              <description>QSPI CORE component version</description>
              <addressOffset>0x05C</addressOffset>
              <access>read-write</access>
              <resetValue>0x3230302A</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SSICCOMPVERSION</name>
                  <description>Contains the hex representation of the Synopsys component version. Consists of ASCII value for each number in the version, followed by *. For example 31_30_33_2A represents the version 1.03*.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x24</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>DR[%s]</name>
              <description>Description collection: QSPI CORE Data Register</description>
              <addressOffset>0x060</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DR</name>
                  <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
