ankuns/nrfx/bsp/stable/mdk/nrf7140_dppr.svd
          <cluster>
            <name>TX</name>
            <description>Unspecified</description>
            <headerStructName>SPIM_DMA_TX</headerStructName>
            <access>read-write</access>
            <addressOffset>0x038</addressOffset>
            <register>
              <name>ENABLE</name>
              <description>Register doesn't do anything. Can be written and read, but has no functionality attached.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ENABLE</name>
                  <description>Register doesn't do anything. Can be written and read, but has no functionality attached.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>PTR</name>
              <description>RAM buffer start address</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PTR</name>
                  <description>RAM buffer start address for this EasyDMA channel. This address is a word aligned Data RAM address.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>MAXCNT</name>
              <description>Maximum number of bytes in channel buffer</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>MAXCNT</name>
                  <description>Maximum number of bytes in channel buffer</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>AMOUNT</name>
              <description>Number of bytes transferred in the last transaction, updated after the END event. Also updated after each MATCH event.</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>AMOUNT</name>
                  <description>Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>CURRENTAMOUNT</name>
              <description>Number of bytes transferred in the current transaction</description>
              <addressOffset>0x010</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>AMOUNT</name>
                  <description>Number of bytes transferred in the current transaction. Continuously updated. Updated when data leaves the internal FIFO and is transferred to the destination.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>LIST</name>
              <description>EasyDMA list type</description>
              <addressOffset>0x014</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TYPE</name>
                  <description>List type</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable EasyDMA list</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ArrayList</name>
                      <description>Use array list</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>TERMINATEONBUSERROR</name>
              <description>Terminate the transaction if a BUSERROR event is detected.</description>
              <addressOffset>0x01C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ENABLE</name>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>BUSERRORADDRESS</name>
              <description>Address of transaction that generated the last BUSERROR event.</description>
              <addressOffset>0x020</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ADDRESS</name>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
