ankuns/nrfx/bsp/stable/mdk/nrf7140_dppr.svd
            </field>
            <field>
              <name>PIN22</name>
              <description>Set as output pin 22</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Read: pin set as input</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Read: pin set as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Write: writing a '1' sets pin to output; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN23</name>
              <description>Set as output pin 23</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Read: pin set as input</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Read: pin set as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Write: writing a '1' sets pin to output; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN24</name>
              <description>Set as output pin 24</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Read: pin set as input</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Read: pin set as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Write: writing a '1' sets pin to output; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN25</name>
              <description>Set as output pin 25</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Read: pin set as input</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Read: pin set as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Write: writing a '1' sets pin to output; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN26</name>
              <description>Set as output pin 26</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Read: pin set as input</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Read: pin set as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Write: writing a '1' sets pin to output; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN27</name>
              <description>Set as output pin 27</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Read: pin set as input</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Read: pin set as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Write: writing a '1' sets pin to output; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN28</name>
              <description>Set as output pin 28</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Read: pin set as input</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Read: pin set as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Write: writing a '1' sets pin to output; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN29</name>
              <description>Set as output pin 29</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Read: pin set as input</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Read: pin set as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Write: writing a '1' sets pin to output; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN30</name>
              <description>Set as output pin 30</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Read: pin set as input</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Read: pin set as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Write: writing a '1' sets pin to output; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN31</name>
              <description>Set as output pin 31</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Read: pin set as input</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Read: pin set as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Write: writing a '1' sets pin to output; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
